class AppConstants {
  static const String appName = 'لجستیک';
  static const String appTagline = 'سامانه هوشمند حمل‌ونقل بار جاده‌ای';

  static const List<String> cargoTypes = [
    'کفی',
    'کمپرسی',
    'یخچالی',
    'تانکر',
    'کانتینربر',
    'بونکر',
    'جرثقیل‌دار',
  ];

  static const List<String> goodsTypes = [
    'مصالح ساختمانی',
    'مواد غذایی',
    'محصولات کشاورزی',
    'مواد شیمیایی',
    'لوازم خانگی',
    'قطعات صنعتی',
    'سایر',
  ];

  static const List<String> cargoStatuses = [
    'در انتظار راننده',
    'تخصیص یافته',
    'تحویل شده',
    'لغو شده',
  ];

  static const List<String> iranProvinces = [
    'آذربایجان شرقی',
    'آذربایجان غربی',
    'اردبیل',
    'اصفهان',
    'البرز',
    'ایلام',
    'بوشهر',
    'تهران',
    'چهارمحال و بختیاری',
    'خراسان جنوبی',
    'خراسان رضوی',
    'خراسان شمالی',
    'خوزستان',
    'زنجان',
    'سمنان',
    'سیستان و بلوچستان',
    'فارس',
    'قزوین',
    'قم',
    'کردستان',
    'کرمان',
    'کرمانشاه',
    'کهگیلویه و بویراحمد',
    'گلستان',
    'گیلان',
    'لرستان',
    'مازندران',
    'مرکزی',
    'هرمزگان',
    'همدان',
    'یزد',
  ];
}
